Revit 2027 API
ParameterTypeId.EllipseYParam Property
 "Y-Radius Value for Ellipse (for Use with XAML Data Template example)"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId EllipseYParam { get; }
Public Shared ReadOnly Property EllipseYParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ EllipseYParam {
	ForgeTypeId^ get ();
}
static member EllipseYParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace